{
  "display":"skill-popup-2",
  "experiences":[
  {"company": "Kingland Systems",
   "position": "Software Engineer",
   "time": [[201601, "now"]],
   "hours": 30,
   "points": [
     "Presented PoCs and used NLP to harvest Data",     
     "Designed DB schemas and Containers on AWS"],
   "desc": "<p>A small-medium sized company that specializes in creating software solutions to  help large credit companies comply with regulations. Notable accomplishments include:</p> <ul> <li>Creating proof-of-concept code and demoing for clients, who eventually signed a large, multi-year contract</li> <li>Implementing Natural Language Processing and Bio-informatics algorithms to scrape information from unstructured data</li> <li>Creating a Docker Container that mounts an AWS EFS drive that runs as a service in AWS ECS</li> <li>Deployed microservice accessed via ELBs on AWS ECS using Terraform</li> <li>Interviewing and mentoring interns, and presenting on behalf of Kingland on campus and at recruiting events</li> </ul>",
   "t_pos":[[70,-90]]},
  {"company": "ISU CS Department",
   "position": "Instructor",
   "time": [[201505, 201506],[201701, 201705]],
   "hours": 20,
   "points": [
     "Created 42 lectures and designed HWs (Java)",
     "Spring'17, lectured >100 students 3x week"],
   "desc": "<p>For the Computer Science Department at ISU I taught two sections of Introduction to Object Oriented Programming, one during the summer of 2015 (30 students), and one during the fall of 2017 (150 students) while also working at Kingland. Check out:</p> <ul> <li>Sample <a href=\"/assets/resume/Day4.pdf\">lecture</a> I made for class</li> <li><a href=\"http://www.ratemyprofessors.com/ShowRatings.jsp?tid=2027383\">Reviews</a> for my classes</li> <li>Sample homeworks and <a href=\"https://github.com/briannoyama/SnakeCA\">code</a> I created</li></ul>",
   "t_pos":[[100,15],[-160, -90]]},
  {"company": "Table 2 Table",
   "position": "Volunteer Android Dev.",
   "time": [[201502, 201604]],
   "hours": 6,
   "points": [
     "Developed a Food Rescue Organization app",
     "Helped hire, advised Undergrad developer"],
   "offset": 30,
   "desc": "<p>While attending graduate school, I volunteered to make an Android application for a food rescue organization called Table to Table. Through this I learned a bit about Android development, and I also managed and advised an undergraduate whom we hired to also work on the app. During this opportunity, I worked closely with Professor Shweta Chopra.</p>",
   "t_pos":[[80,50]]},
  {"company": "ISU CS Department",
   "position": "Research Assistant",
   "time": [[201306,201308],[201405,201406],[201408,201504]],
   "hours": 20,
   "points": [
     "Published two papers and wrote a thesis",
     "Presented research at multiple Universities"],
   "desc": "<p>As a research assistant at Iowa State University, I worked on how to apply concepts from Computer Science and Graph theory to model a method for creating nano-scale machines called DNA Origami. I received some publications and gave some presentations on my work.</p> <h3>Papers/Presentations</h3> <ul> <li>Nakayama, Brian. <a href=\"FinalOralBrianNakayama.pdf\">Modeling Technologies and Methods for DNA Origami</a>. Diss. Iowa State University, 2016.</li> <li>Thein Than Tun, Robyn Lutz, Brian Nakayama, Yijun Yu, Divita Mathur and Bashar Nuseibeh. \"The role of environmental assumptions in failures of DNA nanosystems,\" COUFLESS 2015, Florence, Italy. ACM, 2015.</li> <li>\"Universal Computation in the Prisoner's Dilemma Game,\" UCNC 2014, London, Ontario. Springer: Lecture Notes in Computer Science, 2014.</li> <li>\"<a href=\"/assets/resume/2015MarchComputerSeminarPoster.pdf\">DNA Nanotechnology: The Programmable Building Block of Life</a>,\" Computer Seminar Series. Simpson College: Simpson, IA.</li> </ul>",
   "t_pos":[[-170,10],[-120,80],[40,85]]},
  {"company": "ISU CS Department",
   "position": "Teaching Assistant",
   "time": [[201309,201404],[201508,201512]],
   "hours": 20,
   "desc": "<p>As a teaching assistant I graded, helped students and gave lectures for the following classes: </p><ul> <li>COMS 321: Computer Architectures</li> <li>COMS 409/509: Computer Architectures</li> </ul>",
   "t_pos":[[-160,45],[90, -55]]},
  {"company": "ISU OPPTAG",
   "position": "Instructor",
   "time": [[201407, 201407],[201507, 201507]],
   "hours": 45,
   "desc": "<p>I taught one one-week session of \"Computer Science: Program Your Own Game\" for the Office Precollegiate Programfs for the Gifted and Talented in the summer of 2015. I taught two more one-week sessions in the summer of 2016. My  responsibilities included:</p> <ul> <li>Developping 6 hours of new <a href=\"/assets/resume/PreliminarySyllabus.pdf\">curriculum</a> and activities for students each day</li> <li>Interacting with parents</li> </ul>",
   "t_pos":[[20, 120],[110, -20]]}]
}
