{
  "display":"skill-popup-2",
  "skills":[
  {"type": "Java",
   "amnt": 0.9,
   "desc": "<p>I started teaching myself Java in 2006 before my junior year in highschool. I have since taught others how to program in Java as an instructor for two sections of an undergraduate course titled \"Introduction to Object Oriented Programming\" (COMS 227), and as an instructor for three sections of a highschool summer course titled \"Computer Science: Program Your Own Game.\" While at Kingland, I use Java ~25% of the time.</p>"},
  {"type": "Python",
   "amnt": 0.8,
   "desc": "<p>I first used python to create plugins for DNA Origami CAD software. At Kingland, Python is the primary language I use, and I prefer it for its conciseness and my productivity. However, for speed and traceability statically typed languages (such as Java) often make more sense. </p>"},
  {"type": "PostgreSQL/Flyway",
   "amnt": 0.6,
   "desc": "<ul><li>I have installed, setup and used Postgres for RDBS.</li> <li>I use psql to manually run queries and pgpsql to create server side functions.</li><li>I have used EXPLAIN/ANALYZE commands to find missing indices.</li><li>I have set up cron jobs to vaccuum the database to increase efficiency.</li><li>I have installed and used <a href=\"https://flywaydb.org/\">flyway to incrementally design schemas.</a></li></ul>"},
  {"type": "Linux/Bash/Shell",
   "amnt": 0.6,
   "desc": "<p>Whenever I don't know how to use a command, I think <i>man</i>, if only there was a way to look up what it does? Needless to say, I know just enough to be snarky, but not enough to not use Google! Usually I can get by using a <i>.bashrc</i> file to predefine those pesky PATHs and other commands I have a tough time remembering. I also enjoy Vim, though I have successfully avoided Emacs for quite some time.</p>"},
  {"type": "AWS/Cloud/Terraform",
   "amnt": 0.6,
   "desc": "<p>Amazon Web Services consists of over 90 services. Of those 90 I have used the following:</p><ul><li>Web Console</li><li>Elastic Cloud Compute (EC2) instances</li><li>EC2 Container Service/Repo (ECS/ECR)</li><li>Elastic File System (EFS)</li><li>Elastic Search (Not AWS specific)</li></ul><p>I have also tinkered or helped with the following:</p><ul><li>IAM policies</li><li>Ansible/Terraform/Infrastructure as Code</li><li>DynamoDB</li></ul>"},
  {"type": "Containers/Docker",
   "amnt": 0.5,
   "desc": "<p>I have made and deployed docker containers on AWS ECS clusters. I have created custom containers for Postgres, Airflow, and Python based Natural Language Processing services using a <i>Dockerfile</i>. I have also created custom build contexts by using a script to generate <i>.dockerignore</i> files. Though I still have much to learn in this area, I recognize its power, and I believe this will continue to be important in the future. (I would like to learn more about Container Orchestration Engines in the future.)</p>"},
  {"type": "Git/Version Control",
   "amnt": 0.7,
   "desc": "<ul><li>I wrote the best practices for Git for the benefit of our interns and our team at Kingland.</li> <li>While I would not consider myself an expert, I know enough to manipulate (merge/rebase/checkout) local and remote branches.</li><li>I once diagnosed and fixed a rewrite of our remote git repository committed by an intern using <i>git push --force</i>.</li></ul>"},
  {"type": "LaTeX/SVG",
   "amnt": 0.6,
   "desc": "<p>LaTeX is a scripting language that one can use to create beautiful and interactive PDFs. If I needed to make an important presentation, or if I wanted to write a patent, I would use LaTex to do this. I wrote many homework assignments, most of my lectures and all of my published papers using LaTeX. I also use Standard Vector Graphics for hand coded images. </p>"},
  {"type": "Javascript/JQuery",
   "amnt": 0.7,
   "desc": "<p>When I first learned Javascript, back in 2006, people still had to worry about making their web pages compatible with Netscape, flash was still a thing, and people used \"Dynamic HTML\" to update the Document Object Model. As a language, Javascript has a lot of similarities with Python, despite all the curly braces. I made most of the animations on this webpage by using Javascript to manipulate the DOM of SVG elements, with some help from JQuery where possible to help with transitions and selecting elements.</p>"},
  {"type": "CSS/SASS",
   "amnt": 0.5,
   "desc": "<p>I do not have encyclopedic knowledge of all of the properties one can manipulate with CSS, but I do at least understand the difference between margins and padding. This website shows what I can do with CSS, including some custom, tailored, responsive design.</p>"},
  {"type": "C/C++/Other Lang.s",
   "amnt": 0.4,
   "desc": "<p>Mostly to see what all the hype was about, I used C++ to write:</p><ul><li>A program for approximating the surface area of protein molecules that implements a deterministic algorithm for evenly distributing points on a sphere</li><li>A global sequence alignment algorithm for matching approximately similar pieces of DNA (or any type of string)</li></ul><p>I've also dabbled in other languages:</p> <ul><li>I've used C with the Java Native Interface to write a proof of concept code for rendering a cube using only integer arithmetic</li><li>I've used both Verilog and VHDL to program Field Programmable Gate Arrays</li><li>I also have a fair ammount of experience reading and debugging MIPS assembly, and some experience with AVR</li></ul>"}
  ]
}
